InformationRegisters/ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КонтактыРекрутинговыхСайтов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КонтактыРекрутинговыхСайтов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КонтактыРекрутинговыхСайтов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Whatsapp</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Max</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов/Forms/ФормаНастройки/Ext/Form/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(
		ЭтотОбъект, РегистрыСведений.ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов.Данные());
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура TelegramЗаполнитьПоУмолчанию(Команда)
	Telegram = ВидКонтактнойИнформацииПоУмолчанию(
		ПредопределенноеЗначение("Перечисление.КонтактыРекрутинговыхСайтов.Telegram"));
КонецПроцедуры

&НаКлиенте
Процедура WhatsappЗаполнитьПоУмолчанию(Команда)
	Whatsapp = ВидКонтактнойИнформацииПоУмолчанию(
		ПредопределенноеЗначение("Перечисление.КонтактыРекрутинговыхСайтов.Whatsapp"));
КонецПроцедуры

&НаКлиенте
Процедура MaxЗаполнитьПоУмолчанию(Команда)
	Max = ВидКонтактнойИнформацииПоУмолчанию(
		ПредопределенноеЗначение("Перечисление.КонтактыРекрутинговыхСайтов.Max"));
КонецПроцедуры

&НаКлиенте
Процедура ПрочееЗаполнитьПоУмолчанию(Команда)
	Прочее = ВидКонтактнойИнформацииПоУмолчанию(
		ПредопределенноеЗначение("Перечисление.КонтактыРекрутинговыхСайтов.Прочее"));
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере()
	Данные = РегистрыСведений.ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов.НовыеДанные();
	ЗаполнитьЗначенияСвойств(Данные, ЭтотОбъект);
	РегистрыСведений.ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов.Сохранить(Данные);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидКонтактнойИнформацииПоУмолчанию(Контакт)
	Возврат Перечисления.КонтактыРекрутинговыхСайтов.ВидКонтактнойИнформацииПоУмолчанию(Контакт);
КонецФункции

#КонецОбласти
